In [1]:
import pandas as pd

In [3]:
#series defined by having only one axis
my_Series = pd.Series([1, "cat", 10.2, "dog"])
my_Series

0       1
1     cat
2    10.2
3     dog
dtype: object

In [4]:
my_Series[1]

'cat'

In [9]:
#different from numpy as can define the index
ages = pd.Series([20, 53, 68], index=["John", "Allen", "Mary"])
ages

John     20
Allen    53
Mary     68
dtype: int64

In [10]:
ages["John"]

20

In [14]:
#build/defien a DataFrame
df = pd.DataFrame(
    {
        "user": [1, 2, 3],
        "age": [24, 54, 17],
        "sex": ["F", "F", "M"],
        "occupation": ["technician", "musician", "student"],
    }
)

In [13]:
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [16]:
#change index
df.set_index("user")

      age sex  occupation
user
1      24   F  technician
2      54   F    musician
3      17   M     student

In [17]:
#if want changes applied to the new use inplace=true function
df.set_index("user", inplace=True)
df

      age sex  occupation
user
1      24   F  technician
2      54   F    musician
3      17   M     student

In [18]:
#reset index
df.reset_index(inplace=True)
df

   user  age sex  occupation
0     1   24   F  technician
1     2   54   F    musician
2     3   17   M     student

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user        3 non-null      int64
 1   age         3 non-null      int64
 2   sex         3 non-null      object
 3   occupation  3 non-null      object
dtypes: int64(2), object(2)
memory usage: 224.0+ bytes

In [20]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
#display number of rows
df.shape[0]

3

In [23]:
#display number of columns
df.shape[1]

4

In [24]:
#display labls of all columns
df.columns

Index(['user', 'age', 'sex', 'occupation'], dtype='object')

In [25]:
df.dtypes

user           int64
age            int64
sex           object
occupation    object
dtype: object

In [28]:
#quick statistics of df
df.describe()

       user        age
count   3.0   3.000000
mean    2.0  31.666667
std     1.0  19.655364
min     1.0  17.000000
25%     1.5  20.500000
50%     2.0  24.000000
75%     2.5  39.000000
max     3.0  54.000000

In [30]:
#select specific column
df["occupation"]

0    technician
1      musician
2       student
Name: occupation, dtype: object

if data does not have header can import as df = pd.read_csv("file_name.csv", header=None)

treat all question marks as missing data.. df = pd.read_csv("file_name.csv", na_values["?"])

for excel files use df = pd.read_excel('file_name.xls')